{
  "keras_version": "2.0.6",
  "config": [
    {
      "config": {
        "units": 10,
        "bias_regularizer": null,
        "dtype": "float32",
        "name": "dense_1",
        "kernel_regularizer": null,
        "trainable": true,
        "kernel_initializer": {
          "config": {
            "seed": null,
            "mode": "fan_avg",
            "distribution": "uniform",
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "batch_input_shape": [
          null,
          784
        ],
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "activity_regularizer": null,
        "kernel_constraint": null,
        "activation": "softmax",
        "use_bias": true,
        "bias_constraint": null
      },
      "class_name": "Dense"
    }
  ],
  "class_name": "Sequential",
  "backend": "tensorflow"
}